Revit 2027 API
PipingSystem.PipingNetwork Property
 Pipes and fittings which are contained in this system.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementSet PipingNetwork { get; }
Public ReadOnly Property PipingNetwork As ElementSet
	Get
public:
property ElementSet^ PipingNetwork {
	ElementSet^ get ();
}
member PipingNetwork : ElementSet with get
Property Value
ElementSet
Remarks
 The return value doesn't include mechanical equipment elements. The pipes and fittings are not returned in any particular order.
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace